In [101]:
import pandas as pd

obj = pd.Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [24]:
obj.values

array([ 4,  7, -5,  3])

In [25]:
obj.index  # like range(4)

RangeIndex(start=0, stop=4, step=1)

In [26]:
obj1 = pd.Series(['a','b', 'c', 'd'])
obj1

0    a
1    b
2    c
3    d
dtype: object

In [27]:
obj2 = pd.Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])
obj2

obj2[obj2 > 0]

d    4
b    7
c    3
dtype: int64

In [28]:
'b' in obj2

True

In [29]:
obj3 = pd.Series( {"ID":5430,"Name":"Muhammad Adnan","Designation":"iPhone Developer"})
obj3.name = "Employees"
obj3.index.name = "S No"
obj3

S No
ID                         5430
Name             Muhammad Adnan
Designation    iPhone Developer
Name: Employees, dtype: object

In [30]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [31]:
obj3[[2,4]]

2    purple
4    yellow
dtype: object

In [22]:
pd.isnull(obj3)

0    False
2    False
4    False
dtype: bool

In [15]:
obj2 = pd.Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [29]:
obj2[5]
obj2[5] = "f"
obj2

5     f
10    b
15    c
20    d
dtype: object

In [33]:
data = [[1,2,3],
        [4,5,6],
        [7,8,9]
       ]

pd.DataFrame(data, columns=['year', 'state', 'pop'])

   year  state  pop
0     1      2    3
1     4      5    6
2     7      8    9

In [37]:
frame = pd.DataFrame({
 "Day":[1,2,3,4,5],
  "Temperature":[20,30,14,16,17],
   "WindY":[10,20,30,40,50],
    "Rainy":[True,False,False,True,False]
})
frame

   Day  Temperature  WindY  Rainy
0    1           20     10   True
1    2           30     20  False
2    3           14     30  False
3    4           16     40   True
4    5           17     50  False

In [54]:
frame1 = pd.DataFrame([
    {"Day":"Monday","Temp":107,"Windy": True},
    {"Day":"Tuesday","Temp":127,"Windy": False},
    {"Day":"Wednessday","Temp":237,"Windy": True}

])

frame1.to_excel("temp.xlsx", sheet_name = "Adnan")
frame1

          Day  Temp  Windy
0      Monday   107   True
1     Tuesday   127  False
2  Wednessday   237   True

In [56]:
frame=pd.read_excel("temp.xlsx")
frame

   Unnamed: 0         Day  Temp  Windy
0           0      Monday   107   True
1           1     Tuesday   127  False
2           2  Wednessday   237   True

In [172]:
frame1 = pd.DataFrame([
    (1,107 ,True),
    (2,127 ,False),
    (3,237 ,True),
    (1,107 ,True),
    (2,127 ,False),
    (3,237 ,True),
    (1,107 ,True),
    (2,127 ,False),
    (3,237 ,True)
],
    columns = ["Day","Temp","Windy"]
)
frame1.to_excel("temp.xlsx", sheet_name = "Adnan")
frame1.head()  # return 5 rows by default from start
frame1.head(3) 

frame1.tail()  # return 5 rows by default from end
frame1.tail(3)

#frame1.columns
frame1.Temp  #accessing colum this way should have accurate name, white spaces may cause error
frame1["Temp"]


frame1["Temp"].max()
frame1["Temp"].min()

frame1.describe()  # describe will show all stats for numeric values columns

row,column =frame1.shape
row
column


frame1.shape

frame1.columns

frame1[1:3]
frame1.sort_values(by="Temp")

   Day  Temp  Windy
0    1   107   True
3    1   107   True
6    1   107   True
1    2   127  False
4    2   127  False
7    2   127  False
2    3   237   True
5    3   237   True
8    3   237   True

In [149]:
frame1[['Day','Temp']][frame1['Windy'] == True]

   Day  Temp
0    1   107
2    3   237
3    1   107
5    3   237
6    1   107
8    3   237

In [159]:
frame1[frame1['Temp'] == 107]
frame1['Temp'][frame1['Temp'] == 107]

frame1[frame1['Temp'] > 107]

   Day  Temp  Windy
1    2   127  False
2    3   237   True
4    2   127  False
5    3   237   True
7    2   127  False
8    3   237   True

In [50]:
frame1 = pd.read_excel('temp.xlsx')
frame1

   Unnamed: 0  Day  Temp  Windy
0           0    1   107   True
1           1    2   127  False
2           2    3   237   True

In [48]:
frame1 = pd.DataFrame([
    (1,107 ,True),
    (2,127 ,False),
    (3,237 ,True)
],
    columns = ["Day","Temp","Windy"]
)
frame1.to_csv("temp2.csv")
frame1

   Day  Temp  Windy
0    1   107   True
1    2   127  False
2    3   237   True

In [72]:
import pandas as pd
frame1 = pd.read_csv('temp2.csv')
#frame1["Day"] #for getting only one column
frame1[["Windy","Day"]]  #getting specific colums data

   Windy  Day
0   True    1
1  False    2
2   True    3

In [60]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', "Ali"],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

#keys become colum names and values become rows
frame = pd.DataFrame(data)
frame
frame.sum()

state    OhioOhioOhioNevadaNevadaAli
year                           12009
pop                             15.3
dtype: object

In [130]:
frame2 = pd.DataFrame(data, 
                      columns=['year', 'state', 'pop'],
                      index=['one', 'two', 'three', 'four',
                           'five', 'six'])
'''
frame2.columns
frame2['year']
frame2.year
'''

frame2.to_excel("Adnan.xlsx", sheet_name = "First Sheet")
frame2

       year   state  pop
one    2000    Ohio  1.5
two    2001    Ohio  1.7
three  2002    Ohio  3.6
four   2001  Nevada  2.4
five   2002  Nevada  2.9
six    2003     Ali  3.2

In [131]:
frame2.loc['three'] #geting series at particular index
frame2['Debt']= 15.0 # adding new column

#frame2.index.name ="Student"
frame2.columns.name ="Serial"

frame2

Serial  year   state  pop  Debt
one     2000    Ohio  1.5  15.0
two     2001    Ohio  1.7  15.0
three   2002    Ohio  3.6  15.0
four    2001  Nevada  2.4  15.0
five    2002  Nevada  2.9  15.0
six     2003     Ali  3.2  15.0

In [120]:
import numpy as np

frame2['Debt']= np.arange(6.) # adding new column
frame2

del frame2['Debt']
frame2

       year   state  pop
one    2000    Ohio  1.5
two    2001    Ohio  1.7
three  2002    Ohio  3.6
four   2001  Nevada  2.4
five   2002  Nevada  2.9
six    2003     Ali  3.2

In [119]:
frame2.T  #Transpose, converts colums into rows and rows into colums

        one   two three    four    five   six
year   2000  2001  2002    2001    2002  2003
state  Ohio  Ohio  Ohio  Nevada  Nevada   Ali
pop     1.5   1.7   3.6     2.4     2.9   3.2

In [75]:
frameframe1 = pd.read_excel("Adnan.xlsx")
frameframe1

  Unnamed: 0  year   state  pop
0        one  2000    Ohio  1.5
1        two  2001    Ohio  1.7
2      three  2002    Ohio  3.6
3       four  2001  Nevada  2.4
4       five  2002  Nevada  2.9
5        six  2003     Ali  3.2

In [121]:
frameframe1.index

RangeIndex(start=0, stop=6, step=1)

In [202]:
import numpy as np

frame31 = pd.DataFrame(np.random.randn(4,4),
                       index =pd.date_range('20200104',periods=4),
                       columns =list('ABCD'))

frame32 = pd.DataFrame(np.random.randn(4,4),
                       index=pd.date_range('20200104',periods=4),
                       columns =list('ABCD'))
print(frame31)
print(frame32)

print("Result")
print(frame31+frame32)
# print(frame31-frame32)
# print(frame31*frame32)
# print(frame31/frame32)
# print(frame31 *10)

                   A         B         C         D
2020-01-04 -1.488103  0.353001  0.697140 -0.945081
2020-01-05 -0.543781 -1.524679  0.805378  0.265910
2020-01-06 -0.971180 -0.474695 -1.152589  0.572754
2020-01-07  1.935173  0.437120 -1.560218  0.348646
                   A         B         C         D
2020-01-04  0.849799  1.086351 -0.350671 -0.305147
2020-01-05 -1.479975  0.762794 -0.293787  0.099649
2020-01-06 -1.507965  0.262908 -2.395489  2.895936
2020-01-07 -1.473738  1.163275 -0.828230  0.215316
Result
                   A         B         C         D
2020-01-04 -0.638304  1.439352  0.346469 -1.250228
2020-01-05 -2.023756 -0.761885  0.511591  0.365559
2020-01-06 -2.479144 -0.211787 -3.548077  3.468690
2020-01-07  0.461435  1.600395 -2.388449  0.563962